// Напишите программу, которая на вход принимает число и  выдает,
// является ли число чётным
// 4
// -3
// 7

int A = -3;
if (A % 2 == 0)
{
    Console.WriteLine("четное: " + A);
}
else 
{
    Console.WriteLine("нечетное: " + A);
}

