// Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все четные числа от 1 до N
// 5 > 2, 4
// 8 > 2, 4, 6, 8

int N = 8;
int B = 2;

while (B <= N)
{
    Console.WriteLine(B);
    B += 2;
}